In [1]:
import pandas as pd

data = {
    "Name": ["Aman","Nurkhan","Aliya","Dias","Dana"],
    "Age": [19,21,20,22,18],
    "Score": [85,92,78,88,95]
}

df = pd.DataFrame(data)
df

      Name  Age  Score
0     Aman   19     85
1  Nurkhan   21     92
2    Aliya   20     78
3     Dias   22     88
4     Dana   18     95

In [2]:
df.head(3)

      Name  Age  Score
0     Aman   19     85
1  Nurkhan   21     92
2    Aliya   20     78

In [3]:
df.describe()

             Age      Score
count   5.000000   5.000000
mean   20.000000  87.600000
std     1.581139   6.580274
min    18.000000  78.000000
25%    19.000000  85.000000
50%    20.000000  88.000000
75%    21.000000  92.000000
max    22.000000  95.000000

In [4]:
df["Score"].mean()

np.float64(87.6)

In [5]:
df[df["Age"] > 20]

      Name  Age  Score
1  Nurkhan   21     92
3     Dias   22     88

In [6]:
df[df["Score"] > 80]

      Name  Age  Score
0     Aman   19     85
1  Nurkhan   21     92
3     Dias   22     88
4     Dana   18     95